of60/tutorials/rheoFoam/OtherTests/Channel2D_VE/otherModels/ML-IKH/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             ML-IKH;
                
                rho              rho [1 -3 0 0 0 0 0] 1000.;
                
                etaS             etaS [1 -1 -1 0 0 0 0] 0.430;
		etaP             etaP [1 -1 -1 0 0 0 0] 2.325;  
		lambdaE          lambdaE [0 0 1 0 0 0 0] 0.03875;
		
		C                (0.034130799 0.325416336 0.296194578 0.162989808 0.083621997 0.042308411 0.030337029 0.025001044);
		D                (0.170125428 0.412462638 1 2.424462017 5.878016072 14.2510267 34.55107295 203.0917621);
		
		a                a [0 0 0 0 0 0 0] 2.537; 
                n                n [0 0 0 0 0 0 0] 2; 
                b                b [0 0 0 0 0 0 0] 0.5; 
                
                k1               k1 [0 0 -1 0 0 0 0] 0.042; // Units always 1/s to be independent from parameters (not the real units) 
                k2               k2 [0 0 -1 0 0 0 0] 3e-4;  // Units always 1/s to be independent from parameters (not the real units)  
                k3               k3 [0 0 -1 0 0 0 0] 6e-3;  // Units always 1/s to be independent from parameters (not the real units) 
                
                ky               ky [1 -1 -2 0 0 0 0] 0.434;
                kh               kh [1 -1 -2 0 0 0 0] 0.3; 
                
                q                q [0 0 0 0 0 0 0] 3; 
                
                isStressControlled true;
                
                dims             (1 1 0); // Valid geom dimensions (optional, only needed with rheoTestFoam)
                
                uTauCoupling     true;       
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
